burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_can.h
/* CAN interrupt flags */
typedef enum {
    /* interrupt flags in STAT register */
    CAN_INT_FLAG_SLPIF = CAN_REGIDX_BITS(STAT_REG_OFFSET, 4U, 17U),          /*!< status change interrupt flag of sleep working mode entering */
    CAN_INT_FLAG_WUIF  = CAN_REGIDX_BITS(STAT_REG_OFFSET, 3U, 16),           /*!< status change interrupt flag of wakeup from sleep working mode */
    CAN_INT_FLAG_ERRIF = CAN_REGIDX_BITS(STAT_REG_OFFSET, 2U, 15),           /*!< error interrupt flag */
    /* interrupt flags in TSTAT register */
    CAN_INT_FLAG_MTF2  = CAN_REGIDX_BITS(TSTAT_REG_OFFSET, 16U, 0U),         /*!< mailbox 2 transmit finished interrupt flag */
    CAN_INT_FLAG_MTF1  = CAN_REGIDX_BITS(TSTAT_REG_OFFSET, 8U, 0U),          /*!< mailbox 1 transmit finished interrupt flag */
    CAN_INT_FLAG_MTF0  = CAN_REGIDX_BITS(TSTAT_REG_OFFSET, 0U, 0U),          /*!< mailbox 0 transmit finished interrupt flag */
    /* interrupt flags in RFIFO0 register */
    CAN_INT_FLAG_RFO0  = CAN_REGIDX_BITS(RFIFO0_REG_OFFSET, 4U, 3U),         /*!< receive FIFO0 overfull interrupt flag */
    CAN_INT_FLAG_RFF0  = CAN_REGIDX_BITS(RFIFO0_REG_OFFSET, 3U, 2U),         /*!< receive FIFO0 full interrupt flag */
    CAN_INT_FLAG_RFL0  = CAN_REGIDX_BITS(RFIFO0_REG_OFFSET, 2U, 1U),         /*!< receive FIFO0 not empty interrupt flag */
    /* interrupt flags in RFIFO0 register */
    CAN_INT_FLAG_RFO1  = CAN_REGIDX_BITS(RFIFO1_REG_OFFSET, 4U, 6U),         /*!< receive FIFO1 overfull interrupt flag */
    CAN_INT_FLAG_RFF1  = CAN_REGIDX_BITS(RFIFO1_REG_OFFSET, 3U, 5U),         /*!< receive FIFO1 full interrupt flag */
    CAN_INT_FLAG_RFL1  = CAN_REGIDX_BITS(RFIFO1_REG_OFFSET, 2U, 4U),         /*!< receive FIFO1 not empty interrupt flag */
    /* interrupt flags in ERR register */
    CAN_INT_FLAG_ERRN  = CAN_REGIDX_BITS(ERR_REG_OFFSET, 3U, 11U),           /*!< error number interrupt flag */
    CAN_INT_FLAG_BOERR = CAN_REGIDX_BITS(ERR_REG_OFFSET, 2U, 10U),           /*!< bus-off error interrupt flag */
    CAN_INT_FLAG_PERR  = CAN_REGIDX_BITS(ERR_REG_OFFSET, 1U, 9U),            /*!< passive error interrupt flag */
    CAN_INT_FLAG_WERR  = CAN_REGIDX_BITS(ERR_REG_OFFSET, 0U, 8U),            /*!< warning error interrupt flag */
} can_interrupt_flag_enum;

/* CAN initialize parameters structure */
typedef struct {
    uint8_t working_mode;                                                    /*!< CAN working mode */
    uint8_t resync_jump_width;                                               /*!< CAN resynchronization jump width */
    uint8_t time_segment_1;                                                  /*!< time segment 1 */
    uint8_t time_segment_2;                                                  /*!< time segment 2 */
    uint8_t bit_sample_mode;                                                 /*!< bit sampling synchronization select */
    uint8_t sample_bit_select;                                               /*!< sample bit select */
    uint8_t frame_inter_to_id;                                               /*!< frame inter to identifier enable */
    ControlStatus time_triggered;                                            /*!< time triggered communication mode */
    ControlStatus auto_bus_off_recovery;                                     /*!< automatic bus-off recovery */
    ControlStatus auto_wake_up;                                              /*!< automatic wake-up mode */
    ControlStatus auto_retrans;                                              /*!< automatic retransmission mode */
    ControlStatus rec_fifo_overwrite;                                        /*!< receive FIFO overwrite mode */
    ControlStatus trans_fifo_order;                                          /*!< transmit FIFO order */
    uint16_t prescaler;                                                      /*!< baudrate prescaler */
} can_parameter_struct;

/* CAN transmit message structure */
typedef struct {
    uint32_t tx_sfid;                                                        /*!< standard format frame identifier */
    uint32_t tx_efid;                                                        /*!< extended format frame identifier */
    uint8_t tx_ff;                                                           /*!< format of frame, standard or extended format */
    uint8_t tx_ft;                                                           /*!< type of frame, data or remote */
    uint8_t tx_dlen;                                                         /*!< data length */
    uint8_t tx_data[8];                                                      /*!< transmit data */
} can_transmit_message_struct;

/* CAN receive message structure */
typedef struct {
    uint32_t rx_sfid;                                                        /*!< standard format frame identifier */
    uint32_t rx_efid;                                                        /*!< extended format frame identifier */
    uint8_t rx_ff;                                                           /*!< format of frame, standard or extended format */
    uint8_t rx_ft;                                                           /*!< type of frame, data or remote */
    uint8_t rx_dlen;                                                         /*!< data length */
    uint8_t rx_data[8];                                                      /*!< receive data */
    uint8_t rx_fi;                                                           /*!< filtering index */
} can_receive_message_struct;

/* CAN filter parameters structure */
typedef struct {
    uint16_t filter_list_high;                                               /*!< filter list number high bits */
    uint16_t filter_list_low;                                                /*!< filter list number low bits */
    uint16_t filter_mask_high;                                               /*!< filter mask number high bits */
    uint16_t filter_mask_low;                                                /*!< filter mask number low bits */
    uint16_t filter_fifo_number;                                             /*!< receive FIFO associated with the filter */
    uint16_t filter_number;                                                  /*!< filter number */
    uint16_t filter_mode;                                                    /*!< filter mode, list or mask */
    uint16_t filter_bits;                                                    /*!< filter scale */
    ControlStatus filter_enable;                                             /*!< filter work or not */
} can_filter_parameter_struct;

/* CAN errors */
typedef enum {
    CAN_ERROR_NONE = 0,                                                      /*!< no error */
    CAN_ERROR_FILL,                                                          /*!< fill error */
    CAN_ERROR_FORMAT,                                                        /*!< format error */
    CAN_ERROR_ACK,                                                           /*!< ACK error */
    CAN_ERROR_BITRECESSIVE,                                                  /*!< bit recessive error */
    CAN_ERROR_BITDOMINANT,                                                   /*!< bit dominant error */
    CAN_ERROR_CRC,                                                           /*!< CRC error */
    CAN_ERROR_SOFTWARECFG,                                                   /*!< software configure */
} can_error_enum;

/* transmit states */
typedef enum {
    CAN_TRANSMIT_FAILED = 0U,                                                /*!< CAN transmitted failure */
    CAN_TRANSMIT_OK = 1U,                                                    /*!< CAN transmitted success */
    CAN_TRANSMIT_PENDING = 2U,                                               /*!< CAN transmitted pending */
    CAN_TRANSMIT_NOMAILBOX = 4U,                                             /*!< no empty mailbox to be used for CAN */
} can_transmit_state_enum;

