burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_can.h
/* Sample Bit mode */
#define CAN_ONE_SAMPLE                     ((uint8_t)0x00U)                  /*!< one sample for the received bit */
#define CAN_THREE_SAMPLE                   ((uint8_t)0x01U)                  /*!< three sample for the received bit */

/* Bit sampling synchronization select */
#define CAN_ONE_CYCLE                      ((uint8_t)0x00U)                  /*!< one cycle synchronization for CAN bus sampling */
#define CAN_TWO_CYCLE                      ((uint8_t)0x01U)                  /*!< two cycles synchronization for CAN bus sampling */

/* CAN frame format */
#define CAN_FF_STANDARD                    ((uint32_t)0x00000000U)           /*!< standard frame */
#define CAN_FF_EXTENDED                    ((uint32_t)0x00000004U)           /*!< extended frame */

/* CAN receive FIFO */
#define CAN_FIFO0                          ((uint8_t)0x00U)                  /*!< receive FIFO0 */
#define CAN_FIFO1                          ((uint8_t)0x01U)                  /*!< receive FIFO1 */

/* frame number of receive FIFO */
#define CAN_RFIF_RFL_MASK                  ((uint32_t)0x00000003U)           /*!< mask for frame number in receive FIFOx */

#define CAN_SFID_MASK                      ((uint32_t)0x000007FFU)           /*!< mask of standard identifier */
#define CAN_EFID_MASK                      ((uint32_t)0x1FFFFFFFU)           /*!< mask of extended identifier */

/* CAN working mode */
#define CAN_MODE_INITIALIZE                ((uint8_t)0x01U)                  /*!< CAN initialize mode */
#define CAN_MODE_NORMAL                    ((uint8_t)0x02U)                  /*!< CAN normal mode */
#define CAN_MODE_SLEEP                     ((uint8_t)0x04U)                  /*!< CAN sleep mode */

/* filter bits */
#define CAN_FILTERBITS_16BIT               ((uint8_t)0x00U)                  /*!< CAN filter 16 bits */
#define CAN_FILTERBITS_32BIT               ((uint8_t)0x01U)                  /*!< CAN filter 32 bits */

/* filter mode */
#define CAN_FILTERMODE_MASK                ((uint8_t)0x00U)                  /*!< mask mode */
#define CAN_FILTERMODE_LIST                ((uint8_t)0x01U)                  /*!< list mode */

/* filter 16 bits mask */
#define CAN_FILTER_MASK_16BITS             ((uint32_t)0x0000FFFFU)           /*!< can filter 16 bits mask */

/* frame type */
#define CAN_FT_DATA                        ((uint32_t)0x00000000U)           /*!< data frame */
#define CAN_FT_REMOTE                      ((uint32_t)0x00000002U)           /*!< remote frame */

/* CAN timeout */
#define CAN_TIMEOUT                        ((uint32_t)0x0000FFFFU)           /*!< timeout value */

/* CAN mailbox empty status mask */
#define CAN_ALL_MAILBOX_EMPTY              ((uint32_t)0x1C000000U)           /*!< CAN maibox empty status mask */

/* interrupt enable bits */
#define CAN_INT_TME                        CAN_INTEN_TMEIE                   /*!< transmit mailbox empty interrupt enable */
#define CAN_INT_RFNE0                      CAN_INTEN_RFNEIE0                 /*!< receive FIFO0 not empty interrupt enable */
#define CAN_INT_RFF0                       CAN_INTEN_RFFIE0                  /*!< receive FIFO0 full interrupt enable */
#define CAN_INT_RFO0                       CAN_INTEN_RFOIE0                  /*!< receive FIFO0 overfull interrupt enable */
#define CAN_INT_RFNE1                      CAN_INTEN_RFNEIE1                 /*!< receive FIFO1 not empty interrupt enable */
#define CAN_INT_RFF1                       CAN_INTEN_RFFIE1                  /*!< receive FIFO1 full interrupt enable */
#define CAN_INT_RFO1                       CAN_INTEN_RFOIE1                  /*!< receive FIFO1 overfull interrupt enable */
#define CAN_INT_WERR                       CAN_INTEN_WERRIE                  /*!< warning error interrupt enable */
#define CAN_INT_PERR                       CAN_INTEN_PERRIE                  /*!< passive error interrupt enable */
#define CAN_INT_BO                         CAN_INTEN_BOIE                    /*!< bus-off interrupt enable */
#define CAN_INT_ERRN                       CAN_INTEN_ERRNIE                  /*!< error number interrupt enable */
#define CAN_INT_ERR                        CAN_INTEN_ERRIE                   /*!< error interrupt enable */
#define CAN_INT_WAKEUP                     CAN_INTEN_WIE                     /*!< wakeup interrupt enable */
#define CAN_INT_SLPW                       CAN_INTEN_SLPWIE                  /*!< sleep working interrupt enable */

/* function declarations */
/* initialization functions */
/* deinitialize CAN */
void can_deinit(void);
/* initialize CAN structure */
void can_struct_para_init(can_struct_type_enum type, void *p_struct);
/* initialize CAN */
ErrStatus can_init(can_parameter_struct *can_parameter_init);
/* CAN filter initialization */
void can_filter_init(can_filter_parameter_struct *can_filter_parameter_init);

/* function configuration */
/* enable functions */
/* CAN debug freeze enable */
void can_debug_freeze_enable(void);
/* CAN debug freeze disable */
void can_debug_freeze_disable(void);
/* CAN time trigger mode enable */
void can_time_trigger_mode_enable(void);
/* CAN time trigger mode disable */
void can_time_trigger_mode_disable(void);

/* transmit functions */
/* transmit CAN message */
uint8_t can_message_transmit(can_transmit_message_struct *transmit_message);
/* get CAN transmit state */
can_transmit_state_enum can_transmit_states(uint8_t mailbox_number);
/* stop CAN transmission */
ErrStatus can_transmission_stop(uint8_t mailbox_number);
/* CAN receive message */
void can_message_receive(uint8_t fifo_number, can_receive_message_struct *receive_message);
/* CAN release FIFO */
void can_fifo_release(uint8_t fifo_number);
/* CAN receive message length */
uint8_t can_receive_message_length_get(uint8_t fifo_number);
/* CAN working mode */
ErrStatus can_working_mode_set(uint8_t working_mode);
/* CAN wakeup from sleep mode */
ErrStatus can_wakeup(void);

/* CAN get error type */
can_error_enum can_error_get(void);
/* get CAN receive error number */
uint8_t can_receive_error_number_get(void);
/* get CAN transmit error number */
uint8_t can_transmit_error_number_get(void);

/* interrupt & flag functions */
/* CAN get flag state */
FlagStatus can_flag_get(can_flag_enum flag);
/* CAN clear flag state */
void can_flag_clear(can_flag_enum flag);
/* CAN interrupt enable */
void can_interrupt_enable(uint32_t interrupt);
/* CAN interrupt disable */
void can_interrupt_disable(uint32_t interrupt);
/* CAN get interrupt flag state */
FlagStatus can_interrupt_flag_get(can_interrupt_flag_enum flag);
/* CAN clear interrupt flag state */
void can_interrupt_flag_clear(can_interrupt_flag_enum flag);

#endif /* GD32M53X_CAN_H */
